Revit 2026 API

# UIDocumentShowElements(ICollectionElementId) Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ShowElements(
	ICollection<ElementId> elementIds
)
```
```vb
Public Sub ShowElements (
	elementIds As ICollection(Of ElementId)
)
```
```cpp
public:
void ShowElements(
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
member ShowElements :
        elementIds : ICollection<ElementId> -> unit
```

#### Parameters

elementIds ICollectionElementId

#### Reference

UIDocument Class

ShowElements Overload

Autodesk.Revit.UI Namespace